driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/FaultTest/caGreetService/test/testEJBNormal2Way/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://j2ee.netbeans.org/wsdl/EJBTestDriver">
  <soapenv:Body>
    <ejb:EJBTestDriverOperation>
      <part1>Billy</part1>
    </ejb:EJBTestDriverOperation>
  </soapenv:Body>
</soapenv:Envelope>